print('1. **Перевірка паролю:**')
#   Завдання: Напишіть програму, яка встановлює початковий пароль і перевіряє,
#   чи введений користувачем пароль співпадає з ним. Якщо пароль дорівнює
#   "password123", виведіть повідомлення "Ви увійшли в систему". В іншому випадку
#   виведіть повідомлення "Неправильний пароль".
default_pass = "password123"
#user_pass = input("Введіть пароль: ")
user_pass = "password123"
if user_pass == default_pass:
    print("Ви увійшли в систему")
else:
    print("Неправильний пароль")

print('')
print('=============================')
print('2. **Визначення днів тижня:**')
#  Завдання: Створіть програму, яка встановлює номер дня тижня і виводить назву
#  відповідного дня тижня. Якщо номер дня недійсний (менше 1 або більше 7),
#  виведіть повідомлення про помилку.
def get_day_name(day_number):
    days_of_week = {
        1: "Понеділок",
        2: "Вівторок",
        3: "Середа",
        4: "Четвер",
        5: "Пятниця",
        6: "Субота",
        7: "Неділя"
    }
    return days_of_week.get(day_number, "Невірний номер дня")

try:
    day_number = 4 #int(input("Введіть номер (1-7) для дня тижня: "))
    print('Обраний номер:', day_number)
    if 1 <= day_number <= 7:
        day_name = get_day_name(day_number)
        print(f"Цей день: {day_name}")
    else:
        print("Невірний ввод. Введіть номер між 1 та 7.")
except ValueError:
       print("Невірний ввод. Введіть коректний номер.")

print('')
print('=============================')
print('Цикли:')
print('1. **Таблиця множення:**')
print('Завдання: Виведіть таблицю множення для заданого числа від 1 до 10.')
i = 21 #int(input("Введіть номер для отримання таблиці множення: "))
for i in range(i,i+1):
    print("\n\nТаблиця множення для числа %d\n" %(i))
    for j in range(1,11):
        print("%-2d X %2d = %2d" % (i, j, i*j))

print('')
print('=============================')
print('2. **Сума чисел:**')
print('Завдання: Визначте список чисел і обчисліть їх суму.')
a = [5, 30, 250, 110]
print('Числа у списку:')
for x in a:
    print('-->', x)

res = 0
for val in a:
    res += val
print('Сумма чисел у списку -', res)

print('')
print('=============================')
print('3. **Факторіал числа:**')
print('Завдання: Обчисліть факторіал заданого числа.')
num = 15
#num = int(input("Введіть число для розрахунку факторіала: "))
factorial = 1

if num < 0:
   print("Факторіал для негативних чисел не існує")
elif num == 0:
   print("Факторіал 0 є 1")
else:
   for i in range(1,num + 1):
       factorial = factorial*i
   print("Факторіал числа",num,"складає",factorial)

print('')
print('=============================')
print('4. **Парні числа:**')
print('Завдання: Виведіть всі парні числа від 1 до 50.')

print("Парні числа від 1 до 50: ")
for even in range(1,51):
	if (even%2 == 0):
		print(even)

print('')
print('=============================')
print('5. **Пошук простих чисел:**')
print('Завдання: Знайдіть всі прості числа в заданому діапазоні.')

low = 100
up = 300

print("Прості числа у діапазоні між", low, "та", up, ":")

for num in range(low, up + 1):
   if num > 1:
       for i in range(2, num):
           if (num % i) == 0:
               break
       else:
           print(num)
